In [1]:
import pandas as pd

In [2]:
path = '../Sesion2/data_retail'

path_customers = f'{path}/customers'
path_orders = f'{path}/orders'
path_order_items = f'{path}/order_items'
path_products = f'{path}/products'
path_categories = f'{path}/categories'
path_departments = f'{path}/departments'

In [3]:
df_customers = pd.read_csv((path_customers), sep = '|', header = None)
df_orders = pd.read_csv((path_orders), sep = '|', header = None)  
df_order_items = pd.read_csv((path_order_items), sep = '|', header = None)
df_products = pd.read_csv((path_products), sep = '|', header = None)
df_categories = pd.read_csv((path_categories), sep = '|', header = None, names = ['category_id', 'category_department_id', 'category_name'])
df_departments = pd.read_csv((path_departments), sep = '|', header = None, names = ['department_id', 'department_name'])

In [4]:
df_categories.head()

   category_id  category_department_id        category_name
0            1                       2             Football
1            2                       2               Soccer
2            3                       2  Baseball & Softball
3            4                       2           Basketball
4            5                       2             Lacrosse

In [17]:
df_departments['department_name'].duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
Name: department_name, dtype: bool

In [5]:
def validate_duplicated(df, column_name):
    if df[column_name].duplicated().any():
        print("Hay departamentos duplicados en el dataframe.")
        exit(1)
    else:
        print("No hay departamentos duplicados en el dataframe.")

In [6]:
def validate_department(df):
    if df['department_name'].duplicated().any():
        print("Hay departamentos duplicados en el dataframe.")
        exit(1)
    else:
        print("No hay departamentos duplicados en el dataframe.")

In [17]:
def validate_ids(df,valids_ids):
    if not df['category_department_id'].isin(valids_ids).all():
        print ('Hay ids que no se encuentran en el dataframe')
    else:
        print('OK')

In [7]:
validate_department(df_departments)

No hay departamentos duplicados en el dataframe.

In [8]:
validate_duplicated(df_departments, 'department_name')

No hay departamentos duplicados en el dataframe.

In [9]:
validate_duplicated(df_categories, 'category_department_id')

Hay departamentos duplicados en el dataframe.

In [ ]:
validate_ids(df_categories, valid_ids) # type: ignore

Hay ids que no se encuentran en el dataframe

In [11]:
valid_ids = set(df_departments['department_id'])
valid_ids

{2, 3, 4, 5, 6, 7}

In [12]:
df_categories['category_department_id'].isin(valid_ids)

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
20     True
21     True
22     True
23     True
24     True
25     True
26     True
27     True
28     True
29     True
30     True
31     True
32     True
33     True
34     True
35     True
36     True
37     True
38     True
39     True
40     True
41     True
42     True
43     True
44     True
45     True
46     True
47     True
48    False
49    False
50    False
51    False
52    False
53    False
54    False
55    False
56    False
57    False
Name: category_department_id, dtype: bool

In [14]:
df_categories['category_department_id'].isin(valid_ids).any()

np.True_

In [ ]:
df_categories['category_department_id'].isin(valid_ids).all()

np.False_

In [5]:
df_departments

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors
5              7        Fan Shop

In [ ]:
df_departments.merge(df_categories, on='department_id', how='left')

In [ ]:
df_orders.merge(df_customers, left_on= 'ORDERID', right_on= 'CUSTOMERID', how= 'inner')

,ORDERID,CUSTOMERID_x,ORDERDATE,ORDERSTATUS,CUSTOMERID_y,CUSTOMERNAME,CONTACTLASTNAME,CONTACTFIRSTNAME,PHONE,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521,NaN,NaN
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,NaN,NaN
2,3,2013-07-25 00:00:00.0,12111,COMPLETE,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725,NaN,NaN
3,4,2013-07-25 00:00:00.0,8827,CLOSED,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069,NaN,NaN
4,5,2013-07-25 00:00:00.0,11318,COMPLETE,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12430,12431,2013-10-09 00:00:00.0,4546,PENDING_PAYMENT,12431,Mary,Rios,XXXXXXXXX,XXXXXXXXX,1221 Cinder Pines,Kaneohe,HI,96744,NaN,NaN
12431,12432,2013-10-09 00:00:00.0,3686,PENDING_PAYMENT,12432,Angela,Smith,XXXXXXXXX,XXXXXXXXX,1525 Jagged Barn Highlands,Caguas,PR,725,NaN,NaN
12432,12433,2013-10-09 00:00:00.0,10432,PENDING_PAYMENT,12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756,NaN,NaN
12433,12434,2013-10-09 00:00:00.0,728,PENDING_PAYMENT,12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725,NaN,NaN
12434,12435,2013-10-09 00:00:00.0,9573,PENDING,12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483,NaN,NaN

In [9]:
df_departments.to_csv('departments.csv', index=False)

In [10]:
df_departments.to_json('departments.json', orient='records', indent=2)

In [11]:
import sqlalchemy as db
import pandas as pd

In [12]:
engine = db.create_engine('mysql+mysqlconnector://root:root@localhost:3310/retail_db')
conn = engine.connect()

In [13]:
df_departments.to_sql('departments_2', con=conn , index=False)

6

In [15]:
pd.read_sql('departments_2', con=conn)

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors
5              7        Fan Shop